[
  {
    "id": "1",
    "picture": "https://res.cloudinary.com/mattel-dtc-cloud/image/upload/w_1296,h_1296,c_pad/shop-us-prod/products/qnaw4lfuh3nx9wnkjzln.jpg?v=1683671024",
    "name": "Disney Frozen Anna Fashion Doll",
    "price": "$69.99",
    "rating": 4.8,
    "available_quantity": 300,
    "seller_name": "Foujia Fayeja",
    " seller_email": "fouziafayeja31@gmail.com",
    "sub_category": "frozen",
    "view_details": "Meet Anna, the courageous and cheerful protagonist from Disney's Frozen 2! This posable fashion doll is wearing her signature travel outfit, complete with boots and a soft cloak and skirt. This Anna doll is dressed in her distinctive movie outfit and is ready to embark on an adventure far from home! Doll cannot stand on her own. Colors and decorations are subject to change.This Anna doll is modeled by the popular animated figure from Disney's Frozen 2.This posable Anna fashion doll is dressed in a black and purple travel ensemble that includes a removable soft cape, skirt, and boots.Just like in the movie, Anna's brushable hair is dressed down with a half-crown braid!It's the ideal present for kids who want to act out their favorite Disney Frozen 2 moments or create their own exciting adventures!Fans may amass all of the Disney Frozen fashion dolls and use them to conjure adventures in Arendelle and beyond! Each item is offered separately and is subject to availability."
  },
  {
    "id": "2",
    "picture": "https://res.cloudinary.com/mattel-dtc-cloud/image/upload/w_1296,h_1296,c_pad/shop-us-prod/products/o9vcpjleba138tvw9xih_67b81cf5-2035-4854-818d-ce382b34f3f4.jpg?v=1683670991",
    "name": "Disney Frozen Elsa Fashion Doll ",
    "price": "$39.99",
    "rating": 4.3,
    "available_quantity": 380,
    "seller_name": "Foujia Fayeja",
    " seller_email": "fouziafayeja31@gmail.com",
    "sub_category": "frozen",
    "view_details": "Meet this Elsa doll, inspired by Disney's Frozen's bold and powerful queen! This posable fashion doll is wearing her signature outfit, complete with shoes and a soft cape and skirt. This Elsa doll is dressed in her famous movie attire and is eager to embrace her real self! Doll cannot stand on her own. Colors and decorations are subject to change.Elsa, the renowned cartoon heroine from Disney's Frozen, inspired this doll.This posable Elsa fashion doll is dressed in her signature blue ensemble, which includes a soft cape and changeable skirt and shoes.Elsa's long blonde hair is arranged in a beautiful side braid, exactly as seen in the film!It's the ideal present for kids who want to act out their favorite Disney Frozen scenes or create their own amazing adventures!Fans may amass all of the Disney Frozen fashion dolls and use them to conjure adventures in Arendelle and beyond! Each item is offered separately and is subject to availability."
  },
  {
    "id": "3",
    "picture": "https://res.cloudinary.com/mattel-dtc-cloud/image/upload/w_1296,h_1296,c_pad/shop-us-prod/products/xx85h23wl4hbnkanwslj.jpg?v=1683671435",
    "name": "Disney Frozen Ema Fashion Doll",
    "price": "$29.99",
    "rating": 4.2,
    "available_quantity": 350,
    "seller_name": "Foujia Fayeja",
    " seller_email": "fouziafayeja31@gmail.com",
    "sub_category": "frozen",
    "view_details": "Meet this Ema doll, inspired by Disney's Frozen 2's strong and powerful queen! This posable fashion doll is dressed in her distinctive travel outfit, complete with boots and a soft cloak and skirt. This Ema doll is dressed in her famous attire from the second film and is eager to achieve her destiny! Doll cannot stand on her own. Colors and decorations are subject to change.Ema is a doll based on the renowned cartoon heroine from Disney's Frozen 2.This posable Ema fashion doll is dressed in a vacation suit that includes a soft cape, a changeable skirt, and boots.Ema's brushable blonde hair is arranged in a beautiful side braid, exactly as seen in the film!It's the ideal present for kids who want to act out their favorite Disney Frozen 2 moments or create their own exciting adventures!Fans may amass all of the Disney Frozen fashion dolls and use them to conjure adventures in Arendelle and beyond! Each item is offered separately and is subject to availability."
  }
]
