[
  {
    "id": "1",
    "picture": "https://res.cloudinary.com/mattel-dtc-cloud/image/upload/w_1296,h_1296,c_pad/shop-us-prod/products/ltewiiby86ujt1mkline_71dadeaf-1386-4b55-bdc8-90e97a519036.jpg?v=1683670783",
    "name": "The Little Mermaid Vanessa Fashion Doll",
    "price": "$19.99",
    "rating": 4.5,
    "available_quantity": 300,
    "seller_name": "Foujia Fayeja",
    " seller_email": "fouziafayeja31@gmail.com",
    "sub_category": "mermaid",
    "view_details": "Meet the fearsome antagonist from Disney's upcoming theatrical movie, The Little Mermaid! Vanessa, the sea villain's human form, is represented by a posable fashion doll dressed in her characteristic purple gown with removable shoes and necklace. Fans of The Little Mermaid can collect all of the dolls and create their own adventures above and below the waters. Each doll is offered individually and is subject to availability. Doll cannot stand on her own. Colors and decorations are subject to change.Meet the fearsome antagonist from Disney's upcoming theatrical movie, The Little Mermaid! Vanessa, the sea villain's human form, is represented by a posable fashion doll dressed in her characteristic purple gown with removable shoes and necklace. Fans of The Little Mermaid can collect all of the dolls and create their own adventures above and below the waters. Each doll is offered individually and is subject to availability. Doll cannot stand on her own. Colors and decorations are subject to change.The posable fashion doll has long brown hair for endless styling fun!Makes a perfect gift for kids to play out their favorite Disney The Little Mermaid scenes or make up their own exciting adventures!Fans can collect all the Disney The Little Mermaid fashion dolls to imagine adventures above and below the waves! Each sold separately, subject to availability."
  },
  {
    "id": "2",
    "picture": "https://res.cloudinary.com/mattel-dtc-cloud/image/upload/w_1296,h_1296,c_pad/shop-us-prod/products/ibnfizalbtxm4qizl0dk.jpg?v=1684175198",
    "name": "The Little Mermaid Ariel Doll Inspired By the Movie",
    "price": "$49.99",
    "rating": 4.8,
    "available_quantity": 306,
    "seller_name": "Foujia Fayeja",
    " seller_email": "fouziafayeja31@gmail.com",
    "sub_category": "mermaid",
    "view_details": "Meet the dolls from Disney's newest live-action film, The Little Mermaid! Mermaid with Possibilities Ariel doll is displayed with her iconic mermaid tail and long hair for unlimited styling possibilities. Fans will enjoy recreating their favorite movie scenes or fantasizing about new adventures with Ariel beneath the waters. Doll cannot stand on her own. Colors and decorations are subject to change. The Mermaid Ariel doll is inspired by Ariel from Disney's The Little Mermaid and captures her characteristic look from the film!Posable Ariel fashion mermaid doll sports an ombre-colored mermaid tail with a glitter fin! She wears her distinctive long red hair in a style that emphasizes the beauty of natural hair and makes styling enjoyable!Fans may amass all of the Disney The Little Mermaid dolls and envision adventures both above and below the waves! Each item is offered separately and is subject to availability. It's the ideal present for kids who want to act out their favorite Disney The Little Mermaid moments or create their own exciting adventures! "
  },
  {
    "id": "3",
    "picture": "https://res.cloudinary.com/mattel-dtc-cloud/image/upload/w_1296,h_1296,c_pad/shop-us-prod/products/mztuhiwm5lfcrqlwigi8_dd2c8ffe-d6f4-4cd6-8099-12cb8652fd7d.jpg?v=1684175254",
    "name": "The Little Mermaid Ariel Fashion Doll",
    "price": "$29.99",
    "rating": 4.2,
    "available_quantity": 200,
    "seller_name": "Foujia Fayeja",
    " seller_email": "fouziafayeja31@gmail.com",
    "sub_category": "mermaid",
    "view_details": "Meet the dolls from Disney's most recent theatrical release, The Little Mermaid! The posable Ariel on-land doll is dressed in her distinctive attire and has long hair for unlimited styling possibilities. Fans will enjoy recreating their favorite movie scenes or fantasizing about new adventures with Ariel beneath the waters. Doll cannot stand on her own. Colors and decorations are subject to change.The Ariel on-land doll is inspired by Ariel from Disney's The Little Mermaid and captures her characteristic look from the film!Human Ariel fashion doll has 5 bending joints and is dressed in a removable blue dress with ruffle accents and heels!She wears her distinctive long red hair in a style that emphasizes the beauty of natural hair and makes styling enjoyable!Fans may amass all of the Disney The Little Mermaid dolls and envision adventures both above and below the waves! Each item is offered separately and is subject to availability.It's the ideal present for kids who want to act out their favorite Disney The Little Mermaid moments or create their own exciting adventures!"
  }
]
